Revit 2023 API
IFCVersion Enumeration
 An enumerated type listing available IFC file versions into which a file may be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public enum IFCVersion
Visual Basic
Public Enumeration IFCVersion
Visual C++
public enum class IFCVersion
Members
Member name | Description
Default |  The Autodesk Revit application's default export format. Note that this may change as the defaults change in the Revit user interface.
IFCBCA |  IFC BCA file format. This is a certified variant of IFC 2x2 used for submitting files to the Singapore BCA ePlan Check Server.
IFC2x2 |  IFC 2x2 file format.
IFC2x3 |  IFC 2x3 file format.
IFCCOBIE |  IFC GSA COBIE 2010 file format. This is a variant of IFC 2x3 used for submitting files that are COBIE 2010-complaint.
IFC2x3CV2 |  IFC 2x3 Coordination View 2.0 file format. This is a variant of IFC 2x3 used for exporting files using the Coordination View 2.0 model view.
IFC4 |  IFC 4 file format.
IFC2x3FM |  IFC2x3 Extended FM Handover View
IFC4RV |  IFC4 Reference View
IFC4DTV |  IFC4 Design Transfer View
IFC2x3BFM |  IFC2x3 Basic FM Handover View
See Also
Autodesk.Revit.DB Namespace